[
    {
        "category": "Rockwood",
        "question": "Does the person have a Rockwood frailty score of 5 or above?", 
        "choice1": "Yes",
        "choice2": "No"
    },

    {
        "category": "Mental Capacity",
        "question": "Are there any concerns about the persons ability to give consent?", 
        "choice1": "Yes",
        "choice2": "No"
    },

    {
        "category": "Mental Capacity",
        "question": "Is the person oriented to place and situation and able to consent to remain in hospital?", 
        "choice1": "Yes",
        "choice2": "No",
        "action1": "Could indicate the need for further capacity assessments during their stay in hospital",
        "action2": "Should consider the need to apply for a Deprivation of Liberty (DoLs)\nShould consider involving and Lasting power of attorney (LPOA) in best interest decisions\nCould give advice to the person/ family members about Mental capacity Act."
    
        },

    {
        "category": "Delirium",
        "question": "Does the person present with an actue confusional state?", 
        "choice1": "Yes",
        "choice2": "No"
    
        },

    {
        "category": "Delirium",
        "question": "Is the cause of delirium clear?", 
        "choice1": "Yes",
        "choice2": "No",
        "action2": "Should have further assessment made by the medical team to identify the cause of the delirium. Consider PINCH ME causes."

        },

    {
        "category": "Delirium",
        "question": "Does the current confusional state impact on the persons ability to function and maintain safety at home?", 
        "choice1": "Yes",
        "choice2": "No",
        "action1": "Could consider additional monitoring of resolving delirium at home from family, community services or voluntary sector such as Red Cross if required.",
        "action2": "Should take steps to reduce delirium ‘PINCH ME’. Aim to reduce bed moves and disruption. \nTo facilitate a discharge; Could consider input from case managers to review appropriate options to support the person with delirium such as Pathway 3."
    
        },
    {
        "category": "Memory",
        "question": "Does the person, family or 4AT test indicate concerns relating to memory", 
        "choice1": "Yes",
        "choice2": "No"
    
        },

    {
        "category": "Memory",
        "question": "Does the person or family feel the memory condition would impact on the persons ability to function or maintain safety at home?", 
        "choice1": "Yes",
        "choice2": "No",
        "action1": "Should have an in-patient assessment of safety by an Occupational Therapist or Frailty Practitioner.\nTo facilitate a discharge; Could consider urgent community assessment by therapist on Pathway 1 if deemed safe to return home.\nCould request follow up in community memory services.",
        "action2": "Could consider non-urgent referral to memory services in the community via GP"
        },
    {
        "category": "Continence",
        "question": "Does the persons current continence management meet their needs?", 
        "choice1": "Yes",
        "choice2": "No"
    
        },

        {
        "category": "Continence",
        "question": "Does the current continence situation impact on the persons ability to function, maintain safety and dignity at home?", 
        "choice1": "Yes",
        "choice2": "No",
        "action1": "Should have an in patient continence assessment and plan by occupational therapist, registered nurse or Frailty Practitioner.\nTo facilitate a discharge; Could have immediate continence needs met and urgent referral to community services for rapid follow up. e.g. family purchase or issue pads, bottles or commode and District Nurses visit next day after discharge.",
        "action2": "Could have non urgent referral to community continence services via the District Nurses (DN’s)"

        },

    {
        "category": "Mobility",
        "question": "Has the person has a recent change in their ability to walk or transfer?", 
        "choice1": "Yes",
        "choice2": "No"

        },

    {
        "category": "Mobility",
        "question": "Does the current ability to walk or transfer impact on the persons abilty to function or manitain safety at home?", 
        "choice1": "Yes",
        "choice2": "No",
        "action1": "Should have a mobility review as an in-patient by a physiotherapist or Frailty Practitioner.\nTo facilitate a discharge: Could consider urgent therapy review at home by Pathway 1.",
        "action2": "Could consider a non-urgent referral to community physiotherapy to support mobility review at home."
    
        },

    {
        "category": "Instabilty",
        "question": "Does the person have a history of falls or express a fear of falling?", 
        "choice1": "Yes",
        "choice2": "No"
    
        },

    {
        "category": "Instabilty",
        "question": "Does the person have any of the following? Admitted due to a fall, a history of falls in hospital or they express a fear of falling whilst an inpatient.", 
        "choice1": "Yes",
        "choice2": "No",
        "action1": "Should have a move detailed moving and handling plan. It may be necessary to consider bay nursing or intentional rounding for increased safety.\nShould have an in-patient falls review by a Physiotherapist or Frailty Practitioner.",
        "action2": "Should ensure the person has their regular walking aid, safe footwear and a clear handling plan."
    
        },

    {
        "category": "Instabilty",
        "question": "Does the current risk of falling impact on the persons abilty to function or maintain safety at home", 
        "choice1": "Yes",
        "choice2": "No",
        "action1": "Should have a detailed falls assessment as an in-patient by a Physiotherapist or Frailty Practitioner.\nTo facilitate a discharge; Could consider an urgent community assessment of falls by Pathway 1 if deemed safe to do so.\nShould ensure the person has a plan at home to be able to summon help following a fall. e.g. a pendant alarm, mobile phone or the person they live with is able to summon help.",
        "action2": "Could consider a non-urgent therapy review of falls in the community"
    
        },

    {
        "category": "Self Care",
        "question": "Has the person had a recent change in their ability to wash and dress or prepare food and drink?", 
        "choice1": "Yes",
        "choice2": "No"
    
        },

    {
        "category": "Self Care",
        "question": "Does the current ability to wash and dress or prepare food and drink impact on the persons abilty to function or maintain safety at home?", 
        "choice1": "Yes",
        "choice2": "No",
        "action1": "Should have an in-patient assessment of function by an Occupational Therapist or Frailty Practitioner.\nTo facilitate a discharge: could consider an urgent community functional assessment by Pathway 1 if it is deemed safe to do so.",
        "action2": "Could consider a non-urgent referral to community therapy to review functional ability at home."
    
        },

    {
        "category": "Support",
        "question": "Does the person feel they have adequate support in place to meet their needs? This includes: Formal Care support, Family and informal support, Shopping services and support with domestic tasks.", 
        "choice1": "Yes",
        "choice2": "No",
        "action1": "Should confirm with existing Care givers that they are able to continue to support and agree a re-start time."
    
        },

    {
        "category": "Support",
        "question": "Does the current support situation impact on the persons ability to function or maintain safety at home?", 
        "choice1": "Yes",
        "choice2": "No",
        "action1": "Should have an in-patient review of the persons care needs by an occupational therapist, case manager or Frailty Practitioner.\nTo facilitate a discharge;\n* Could consider urgent community review by Pathway 1 with re-ablement if it is safe to do so.\n* Could have urgent input from Red Cross home from hospital if this would meet the identified needs.\n* Could discuss with family how to meet the persons support needs.",
        "action2": "Could consider non-urgent referral to third party/ voluntary sector for advice. E.g. Age UK or Red Cross."
    
        },

    {
        "category": "Medication",
        "question": "Has the person had a recent medication review as well as having a plan at home that works to help them take their medication?", 
        "choice1": "Yes",
        "choice2": "No"
    
        },

    {
        "category": "Medication",
        "question": "Is the person on five or more medications?", 
        "choice1": "Yes",
        "choice2": "No",
        "action1": "Should have a review of medication as an in-patient by a pharmacist, Geriatrician or Frailty Practitioner using STOPP-START principals."
    
        },

    {
        "category": "Medication",
        "question": "Has the person identified a difficulty with how they are ableto be concordant with their medication pescription at home? This includes: Difficulty remembering to take tablets, difficulty getting to a pharmacy and difficulty opening bottles.", 
        "choice1": "Yes",
        "choice2": "No",
        "action1": "Should have further assessment from in-patient Pharmacy, medical team or Frailty Practitioner to create home medication plan."
    
        },

    {
        "category": "Physical Welbeing",
        "question": "Does the person show signs of frailty syndromes? Including: Unintentional weight loss, increased weakness, slower walking speed, reduces levels of activity and exhaustion", 
        "choice1": "Yes",
        "choice2": "No"

        },

    {
        "category": "Physical Welbeing",
        "question": "Does the current situation of increasing frailty impact on the persons abiltity to function or maintain safety at home?", 
        "choice1": "Yes",
        "choice2": "No",
        "action1": "Should have review by Frailty Practitioner to examine for elements of reversibility and to manage symptoms.\nShould have opportunity to discuss ReSpect and Treatment escalation plan (TEP) with a geriatrician or medical team. 'Think last 1000 days'.\nShould have request for GP to discuss Advanced Care Planning in community.\nCould consider input from other specialists such as dieticians.",
        "action2": "Could have non-urgent community Frailty review.\nCould have conversations in community to discuss Advanced Care Planning. Request GP to follow up."

        },

    {
        "category": "Psychological Welbeing",
        "question": "Does the person or relative express concerns relating to the persons mental welbeing? This can include: Social isolation, depression and mental health conditions", 
        "choice1": "Yes",
        "choice2": "No"
    
        },

    {
        "category": "Psychological Welbeing",
        "question": "Does the persons current mental welbeing impact on their ability to function or maintain safety at home?", 
        "choice1": "Yes",
        "choice2": "No",
        "action1": "Should have further assessment by the medical team or acute Mental Health team to establish treatment plan for psychological wellbeing.\nCould consider input from third party or voluntary sector e.g Red Cross befriending service if this meets the persons needs.",
        "action2": "Could consider referral to self help services in community or non-urgent mental health team input."

        },

    {
        "category": "Communication and Sensory Systems",
        "question": "Does the person have an impairment which impacts on their ability to see, hear or communicate thier needs?", 
        "choice1": "Yes",
        "choice2": "No"

        },

    {
        "category": "Communication and Sensory Systems",
        "question": "Does the current sensory and communication situation impact on the persons ability to function or maintain safety at home or whilst in hospital?", 
        "choice1": "Yes",
        "choice2": "No",
        "action1": "Should consider safety and accessibility on the ward and adapt appropriately\ne.g. hearing amplifier, whiteboard for writing, bay nursing for increased observation and the use of intentional rounding.\nCould consider further assessment from hearing therapist, Speech and language therapist (SALT), eye hospital, Learning disabilities team, dementia team.\nCould suggest to the person they access a rapid review in the community with opticians or hearing services. ",
        "action2": "Could recommend the person access regular reviews with community opticians."
    
        },

    {
        "category": "Other",
        "question": "Is the person experiencing any other issue that would impact on their ability to function or maintain safety at home? This could include: Poorly controlled pain, uncontrolled co-morbidities or environmental issues such insufficient heating or safeguarding concerns", 
        "choice1": "Yes",
        "choice2": "No",
        "action1": "Should have further review by appropriate service relating to the specific issue/ issues(s).\nPlease detail…'the person requires support with……………'"
    
        }
    ]